icecreams_api/app/controllers/ice_creams_controller.rb

SELECT "ice_creams".* FROM "ice_creams"
---
  def index
    @ice_creams = IceCream.all

SELECT "ice_creams".* FROM "ice_creams" WHERE "ice_creams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ice_cream
      @ice_cream = IceCream.find(params[:id])