icecreams_api/app/controllers/pints_controller.rb

SELECT "pints".* FROM "pints" WHERE "pints"."ice_cream_id" = $1  [["ice_cream_id", 1]]
---
  def index
    @pints = Pint.all